[
	{
		"title": "Honkai Star Rail: Trailblaze Level Calculator",
		"id": "hsr-tb-calculator",
		"icon": "trailblaze-power.webp",
		"description": "This tool lets you easily see how long it will take you to reach higher levels in the video game Honkai: Star Rail. I always wanted something like this while playing, since reaching higher levels grant you better rewards, but it often takes weeks of waiting to get to the level you want, so I made this tool to calculate how much time it would take. Before this, the only tool to do something similar was a Google spreadsheet that was slightly difficult to use, and didn't factor in higher levels giving you higher EXP, so an easy-to-use tool with an accurate calculation was needed.",
		"link": {
			"title": "Git Repository",
			"url": "https://github.com/lianeville/HSR-Trailblaze-Level-Calculator"
		},
		"technologies": ["React", "TypeScript", "TailwindCSS"],
		"images": [
			{
				"title": "Calculator",
				"url": "HSR-Demo-Screenshot.png"
			}
		]
	},
	{
		"title": "Silly Chat - Anonymous Chat App",
		"id": "silly-chat",
		"icon": false,
		"description": "Silly Chat is a lightweight chat web app that lets users talk anonymously without needing an account. One thing that's always annoyed me about the internet is almost every site begging you to create an account and enter your email, phone number, or whatever else, so I wanted to this to be different. It lets uses create sessions, and chat publicly and anonymously without needing to create an account, but still makes it clear who's talking by assigning each user a random name.",
		"link": {
			"title": "Git Repository",
			"url": "https://github.com/lianeville/silly-chat"
		},
		"technologies": ["React", "MongoDb", "Express", "Node", "TailwindCSS"],
		"images": [
			{
				"title": "Dashboard",
				"url": "silly-chat-dashboard.png"
			},
			{
				"title": "Messages",
				"url": "silly-chat-messages.gif"
			}
		]
	},
	{
		"title": "jFilter - jQuery filtering plugin",
		"id": "jfilter",
		"icon": "jFilterLogo.jpg",
		"description": "One of the first things I did at Docket was introduce a filtering system so users can see all their tickets in an organized way. I developed it gradually the whole time, and eventually decided to make it agnostic to Docket for anybody to use it. I'm particularly proud of the coloring system; each of the filter's categories becomes bright and colorful when that category is filtered, and all currently active filters are displayed below and organized by color, so you always know what's being filtered at a glance.",
		"link": {
			"title": "Git Repository",
			"url": "https://github.com/lianeville/jFilter"
		},
		"technologies": ["jQuery", "Bootstrap", "Popper.js"],
		"images": [
			{
				"title": "jFilter",
				"url": "jFilter.gif"
			}
		]
	},
	{
		"title": "LastFM Delete Scrobbles Extension",
		"id": "lastfm",
		"icon": false,
		"description": "One day, I let someone use my Spotify account, only to realize I suddenly had thousands of songs completely foreign to me in my LastFM history. This bothered me (for some reason) enough to try deleting them one by one, but then realized how silly that was and made a Chrome extension to do it for me.",
		"technologies": ["Chrome Extension API"],
		"link": {
			"title": "Git Repository",
			"url": "https://github.com/lianeville/LastFm-Extension-Delete-Visible"
		},
		"images": [
			{
				"title": "Delete Scrobbles.",
				"url": "LastFM.gif"
			}
		]
	}
]
